---
kind: type
id: T:Autodesk.Revit.UI.Selection.PickedBox
source: html/a3fd7f60-6f17-0a81-8e10-22fdcd988897.htm
---
# Autodesk.Revit.UI.Selection.PickedBox

A class that contains two XYZ points representing the pick box on the screen.

## Syntax (C#)
```csharp
public class PickedBox
```